{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_1", "batch_input_shape": [null, 3, 256, 256], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "padding": "valid", "filters": 1, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_first", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_2", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_first", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_3", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "filters": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_first", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_4", "kernel_size": [3, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_first", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.4"}