{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dtype": "float32", "trainable": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 3, 32, 32], "kernel_regularizer": null, "kernel_constraint": null, "filters": 1, "activation": "relu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "filters": 2, "activation": "relu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "padding": "valid", "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "filters": 4, "activation": "relu", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "name": "dense_1", "units": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "name": "dense_2", "units": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activity_regularizer": null, "name": "dense_3", "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}]}