{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "conv2d_1", "filters": 1, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 3, 32, 32], "kernel_size": [3, 3], "data_format": "channels_first", "bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_first", "trainable": true, "kernel_regularizer": null, "name": "conv2d_2", "filters": 2, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_first", "trainable": true, "kernel_regularizer": null, "name": "conv2d_3", "filters": 4, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 24, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "units": 12, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "units": 3, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.0.4"}