{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 1, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 3, 32, 32], "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 2, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 4, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 24}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 12}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 3}}], "keras_version": "2.0.4"}