{"backend": "tensorflow", "config": [{"config": {"trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "data_format": "channels_first", "dtype": "float32", "batch_input_shape": [null, 3, 32, 32], "bias_constraint": null, "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "data_format": "channels_first", "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 2, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "data_format": "channels_first", "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "filters": 4, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "tanh", "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 24}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "tanh", "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "name": "dense_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 3}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.4"}