{"config": [{"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "strides": [1, 1], "filters": 1, "use_bias": true, "name": "conv2d_1", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 2, "name": "conv2d_2", "data_format": "channels_first", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 4, "name": "conv2d_3", "data_format": "channels_first", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 24, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 12, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.1, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 3, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow"}