{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "filters": 1, "trainable": true, "batch_input_shape": [null, 3, 256, 256], "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_size": [3, 3], "dtype": "float32", "bias_constraint": null, "name": "conv2d_1", "activation": "relu", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 2, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_2", "activation": "relu", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 4, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_3", "activation": "relu", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 8, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_4", "activation": "relu", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "dense_1", "activation": "tanh", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "dense_2", "activation": "tanh", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "name": "dense_3", "activation": "softmax", "bias_regularizer": null}}]}