{"backend": "tensorflow", "keras_version": "2.0.4", "config": [{"config": {"trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 3, 256, 256], "name": "conv2d_1", "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_first", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "units": 24, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "units": 12, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "activity_regularizer": null, "units": 3, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}