{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 1, "activation": "relu", "trainable": true, "name": "conv2d_1", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 3, 256, 256], "kernel_constraint": null, "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 2, "activation": "relu", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "kernel_constraint": null, "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 4, "activation": "relu", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "kernel_constraint": null, "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "tanh", "use_bias": true, "trainable": true, "units": 24, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.1}}, {"class_name": "Dense", "config": {"activation": "tanh", "use_bias": true, "trainable": true, "units": 12, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.1}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "trainable": true, "units": 3, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}], "backend": "tensorflow", "keras_version": "2.0.4"}