{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 3, 256, 256], "data_format": "channels_first", "name": "conv2d_1", "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "filters": 1, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_constraint": null, "data_format": "channels_first", "name": "conv2d_2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 2, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_constraint": null, "data_format": "channels_first", "name": "conv2d_3", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 4, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_constraint": null, "data_format": "channels_first", "name": "conv2d_4", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 8, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "units": 24, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "units": 12, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "use_bias": true, "name": "dense_3", "units": 3, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential"}